{
    "https://www.barandbench.com/news/litigation/trp-scam-former-barc-employees-conspired-republic-mumbai-police": "[TRP Scam] Former BARC employees conspired with Republic to manipulate TRPs: Mumbai PoliceSIGN INTRP Scam, Republic TV[TRP Scam] Former BARC employees conspired with ARG Outlier CEO to manipulate Republic TV TRPs: Mumbai Police in chargesheetCrime Branch in the supplementary chargesheet claim to have found evidence to suspect that former BARC senior officials have aided the CEO of Republic channels to manipulate their viewership ratings for higher revenue.Published on : 12 Jan, 2021 , 6:54 amThe Mumbai Police has filed a supplementary chargesheet in FIR No. 843 of 2020 which concerns the alleged fake  brought to light by its Crime Branch. The supplementary chargesheet states that Vikas S Khanchandani (Accused no. 13), Chief Executive Officer of ARG Outlier Media, Romil V Ramgarhia (Accused no. 14) and Partho Dasgupta (Accused no. 15) - the latter being former senior officials of Broadcast Audience Research Council (BARC) - along with other accused have conspired to manipulate viewership data leading to manipulation of TRPs so as to procure more revenue from advertisements on their channels.The chargesheet states that the Khanchandani along with Priya Mukherjee, Chief Operating Officer (COO) of ARG, carried out transactions in order to ensure that more viewers watch their channels - Republic TV (English) and Republic Bharat (Hindi). The same was discovered through their WhatsApp group chats.It further states that the Republic channels have been allegedly flouting the Telecom Regulatory Authority of India (TRAI) regulations by paying cable operators and multi-system operators for using the 'dual/promotional local channel number' to telecast their news channels on more than a single channel.The chargesheet has alleged that Ramgarhia misused his position as Chief Operating Officer (CEO) of BARC to aid Republic channels to manipulate their TRPs.Ramgarhia allegedly conducted internal inquiries into BARC through an independent company 'Acquisitory Risk Consulting Pvt Ltd.' which gave Ramgarhia and his co-accused insight into the working of TRP calculation.The investigation also cites emails found in Ramgarhia’s work account which discussed how the BARC data is aiding Republic channels though TRP manipulation. The viewership rating of Times Now, which was higher than Republic, was deliberately manipulated to increase the viewership rating of Republic channels, the Police have claimed.The chargesheet has declared Partho Dasgupta to be the mastermind of the TRP scam. During his tenure as the Chief Executive Officer of BARC, he allegedly used his position to aid ARG Outlier to manipulate the TRP ratings, it has been claimed in the chargesheet.The Mumbai Police claims that during its investigation, it came across evidence that showed Republic Editor-in-Chief Arnab Goswami had paid Dasgupta in return for his assistance in manipulating the TRPs.The evidence, they claim, was the gold and precious items which Dasgupta allegedly purchased with the money received from Goswami. The items were discovered during the search and seizure carried out at Dasgupta’s residence.Apart from the specifics of the three accused, the supplementary chargesheet includes 59 witnesses, which includes 12 expert witnesses (forensic auditors, computer forensics auditors). The Crime Branch has managed to seize property worth approximately Rs 50 lakh, which includes personal computers, laptops, mobile phones, jewellery and watches, it was claimed. The Mumbai Police have found evidence against general entertainment channels and two Telugu regional channels as well, which they will be further investigating.The Crime Branch filed its first  in November 2020 which included details of the first twelve accused. The Crime Branch initiated the investigation in the TRP scam after it discovered, through certain employees of the Hansa Group, that ‘sampling metering services’ were being manipulated by paying people to watch particular TV channels.A rise in TRPs was, thereby, allegedly achieved by paying money to the television viewers whose houses had barometers installed.The viewers watched the specified channels for longer hours to show an escalated viewership of the channel, it is alleged.Related StoriesBar and Bench - Indian Legal news  www.barandbench.com INSTALL APP",
    "https://timesofindia.indiatimes.com/india/trp-scam-no-1-channel-times-now-deliberately-pushed-to-no-2-spot-says-mumbai-police/articleshow/79956324.cms": " TRP scam: No.1 channel Times Now deliberately pushed to No.2 spot, says Mumbai Police | India News - Times of IndiaEnglish||Sign InIndiaEditorialsSocialServicesTRP scam: No.1 channel Times Now deliberately pushed to No.2 spot, says Mumbai PoliceTop Searches:TRP scam: No.1 channel Times Now deliberately pushed to No.2 spot, says Mumbai Police | TNN | Updated: Dec 26, 2020, 06:11  ISTMilind Bharambe, Joint CP Crime, Mumbai PoliceMUMBAI: In a major development in the TRP manipulation scam, Mumbai joint commissioner (crime) Milind Bharambe said Friday that ratings were manipulated to push English news channel Times Now from the top slot to No. 2 and make Republic TV No. 1. Times Now was No. 1, but within a week of Republic TVâ\u0080\u0099s launch in 2017, officials at the Broadcast Audience Research Council connived to push Times Now to No. 2, Bharambe said. (Times Now is part of the Times Group, to which this paper belongs.) BARC found out about manipulations in June but didnâ\u0080\u0099t inform us, say copsSimilarly, another news channel, CNN-News 18 (formerly CNN-IBN), was pushed to the third slot from its second position, officials said. Bharambe said the manipulations came to light in a forensic audit by a third party at the instance of BARC in June this year, but the findings were not shared with police, which launched an investigation a few months ago and registered an FIR on October 6. BARC India measures the viewership of TV channels, which is crucial for broadcasters to decide on advertising. â\u0080\u009cThe auditing was done for 44 weeks in detail on English and Telugu news channels and a few entertainment channels, and it was found to be manipulated to a great extent. The TRP ratings were pre-decided and to achieve the highest TRP for particular channels, viewership data was manipulated using three methods,â\u0080\u009d Bharambe said. Police said they have come upon WhatsApp chats and emails between BARC employees discussing how to manipulate the ratings. The three methods employed for manipulation, Bharambe said, were â\u0080\u009coutlier, meta rules and channel audience controlâ\u0080\u009d. â\u0080\u009cData was selectively analysed to show particular TRP ratings of a channel,â\u0080\u009d Bharambe said. He said this was done to facilitate and bring Republic TV to the No. 1 slot. The manipulations were carried out by two senior BARC officials during the period 2016-2019, police alleged. These officials, the CEO and COO, were asked to resign or face action by BARC, Bharambe said. Both officials quit and are in police custody. â\u0080\u009cDuring that period, there were complaints of manipulation that were suppressed,â\u0080\u009d he said. Police officials claimed BARC had knowledge about the officialsâ\u0080\u0099 involvement but did not inform the cops during its probe. Cops came to know about audit report through their own sources and from detailed interrogation of the two arrested ex-officials, they said. Bharambe read out some excerpts from the messages found. â\u0080\u009cPlease find below numbers on English news. As required, Times Nowâ\u0080\u0099s numbers were changed while Republic was kept the same.â\u0080\u009d Another message read, â\u0080\u009cPlease find below updates on English news channels for week X. Times Now, CNN -News18 will be changed. The impressions of Times Now had been decreased drastically across the universe. The impressions of Republic TV remained unchanged.â\u0080\u009d He declined to disclose the identities of people who had shared these messages. Bharambe said the forensic report is a strong piece of evidence and police will be adding it in the supplementary chargesheet. Police have already submitted a chargesheet in the case. Police said their investigations have revealed that the arrested persons connived to manipulate the sampling metering services by inducing barometer users by paying them periodically to watch particular channels. Many people in whose homes barometers were installed have acknowledged benefiting monetarily for keeping their TV sets on. The ex-CEO of BARC, arrested on Thursday, was produced before Esplanade Court on Friday and remanded in police custody till December 28. He is the 15th person held in the case. In a statement, Republic TV described policeâ\u0080\u0099s Friday revelations as a â\u0080\u009cridiculous and bizarre witchhuntâ\u0080\u009d. In Video:DownloadThe Times of India  for Latest more from times of india newsCoronavirus outbreakTrending TopicsLATEST VIDEOSMore from TOINavbharat TimesFeatured Today in TravelQuick LinksGet the app",
    "https://www.timesnownews.com/india/article/trp-scam-times-now-was-deliberately-made-number-2-by-massive-data-manipulation-says-mumbai-police/699050": "﻿Republic TV TRP Scam | TRP scam: Times Now was deliberately made No 2 by massive data manipulation, says Mumbai Police | India News> >TRP scam: Times Now was deliberately made No 2 by massive data manipulation, says Mumbai Police        Updated Dec 25, 2020 | 18:33 IST                  Three months after the Mumbai Police busted a major racket for manipulating TRP, details of the probe revealed that the former CEO of BARC facilitated malpractices to degrade the ratings of Times Now.TAP TO UNMUTE\r        Milind Bharambe, Joint CP Crime, Mumbai Police.       Key HighlightsAs per the forensic report, the data of 44 weeks – from mid-2017 – mentions how viewership and TRP data was manipulated by using three of BARC’s methodologiesThe report states that in some of the cases, the ratings appeared to be pre-decided“Was Times Now deliberately made Number 2?”“As per the report, yes,” Milind Bharambe, Joint Commissioner of Police (Crime), Mumbai Police, said.Nearly three months after the Mumbai Police busted a major racket for manipulating television rating points (TRP), details of the investigation have revealed that former CEO of the Broadcast Audience Research Council (BARC) Partho Dasgupta, who was arrested on Thursday, had facilitated malpractices with other TV news channels to degrade the ratings of Times Now.Addressing a press conference in Mumbai, Bharambe said that TRP manipulation had been happening since 2016 where ratings appeared to be pre-decided.The scam took place when Dasgupta was the head of BARC from 2013 to 2019. During that period, many tried to expose the manipulation that was being done but whistleblowers were clinically suppressed. He has now been taken in to custody till December 28.“After the new dispensation took over at BARC, forensic audit of data was organised and the third-party audit team submitted its report in July 2020. As per the report, the manipulations have been going on at least from 2016-2019. The forensic team analysed data of around 44 weeks in detail, especially in the genre of English and Telugu news where they found manipulation to a great extent,” Bharambe said.As per the forensic report, the data of 44 weeks – from mid-2017 – mentions how viewership and TRP data was manipulated by using three of their methodologies, in which two channels are mentioned as per the report – Times Now (which was on No 1 in English at that time) was thrown to No 2 due to manipulation of data and Republic TV was put on No 1 spot.The report further states that in some of the cases, the ratings appeared to be pre-decided. The report also pointed towards the cartelisation of top officials and ex-officials of BARC.“Of the 3 methods used to screen and analyse the data – Outlier method, Meta method and Channel Audience Control – the data was selectively chosen, analysed and thrown to showcase a particular TRP rating of a particular channel. The report also mentions quite a few emails and chats between the top officials which point towards all these types of manipulations, which are absolutely incriminating,” the top cop said. | Mumbai Police News Conference on the TRP Scam.\rMilind Bharambe, Joint CP Crime, Mumbai: TRP manipulation happening since 2016. Rating appeared to be pre-decided.\rListen in. \r— TIMES NOW (@TimesNow) Excerpts from the chats, as per the Mumbai Police report:Please find below numbers on English news. As required, Times Now’s numbers were changed while Republic was kept the same.Please find below updates on English news channels for week X. Times Now, CNN News18 will be changed. The impressions of Times Now had been decreased drastically across the universe. The impressions of Republic TV remained unchanged.Don’t think we should edit the statements. We can manage by changing the logic. | Was TIMES NOW deliberately made no. 2?\r‘As per the report, yes’, Milind Bharambe, Joint CP Crime, Mumbai, tells TIMES NOW’s Kajal.\rListen in. \r— TIMES NOW (@TimesNow) RELATED NEWS Republic TV ‘laughs’ at allegationsThe Mumbai Police’s claims are laughable. The Republic Media Network would like to destroy their claims with the following points:BARC has on two occasions written email to Republic dates 17 October 2020 and 20 November 2020, saying there was no question of any manipulation by Republic TV.The forensic report that the Mumbai Police is referring to is from July 2020. BARC’s emails to us are from November and December 2020. It defies common sense why BARC would give Republic Media Network a complete clean chit in November and December. The Mumbai Police should have thought about that.Republic Media Network’s ratings soared high in 2020 after the previous dispensation at BARC moved out. If you look at the data, the viewership increased in the second half of 2020. Does that Mumbai Police have any explanation for this? Or does it hold the current dispensation at BARC guilty for the viewership of Republic TV?NEWS RELEASE: Republic's response to Mumbai Police’s latest claims in the TRP Case. \r— Republic (@republic) BARC statementThe development related to ex-employees of BARC India is a part of an ongoing investigation for which BARC management continues to extend its support and cooperation to the law enforcement agencies. It would consequently be inappropriate for BARC to comment any further at this stage.Every employee of BARC India is expected to conform to a Code of Conduct & Ethics and any infringement invites suitable disciplinary action. We will continue to ensure that WHAT INDIA WATCHES is reported accurately and with utmost integrity. It’s a responsibility we owe all our stakeholders.Watch Times Now  for latest and breaking news from  and around the .TAP TO UNMUTETAP TO UNMUTEVIDEOSJUST INMOST READNEXT STORY",
    "https://www.nationalheraldindia.com/india/barc-data-reveals-trp-manipulation-put-arnab-goswamis-republic-tv-on-top-spot-happening-since-2016": "BARC data reveals TRP manipulation put Arnab Goswami’s Republic TV on top spot; happening since 2016SearchLoginSearchFollow UsLoginBARC data reveals TRP manipulation put Arnab Goswami’s Republic TV on top spot; happening since 2016Addressing a press conference on Friday, Milind Bharambe, Joint CP (Crime) of Mumbai Police said in some cases the ratings appeared to be pre-decidedEx-CEO of rating agency BARC and Arnab Goswami Published: 25 Dec 2020, 9:00 PMEngagement: 0A day after the Crime Branch of Mumbai Police arrested Partho Dasgupta, ex-CEO of rating agency Broadcast Audience Research Council (BARC) for his alleged involvement in the TRP scam, Mumbai Police said the TRP manipulation was happening since 2016 and that Arnab Goswami’s Republic TV was put on the top spot by dislodging Times Now.Addressing a press conference on Friday, Milind Bharambe, Joint CP (Crime) of Mumbai Police said an audit of BARC data had made stunning revelations about TRP manipulations.“After the new dispensation took over at BARC, forensic audit of data was organised and the third-party audit team submitted its report in July 2020. As per the report, the manipulations have been going on at least from 2016-2019. The forensic team analysed data of around 44 weeks in detail, especially in the genre of English and Telugu news where they found manipulation to a great extent,” Bharambe said, as per a report carried by jantakareporter.com.As per the forensic report, the data of 44 weeks from mid-2017 mentions how viewership and TRP data was manipulated by using three of their methodologies, in which two channels are mentioned as per the report – Times Now was thrown to No 2 due to manipulation of data and Republic TV was put on No 1 spot.In some cases, he added, the ratings appeared to be pre-decided, and that a cartel of some of BARC’s top ex-officials were involved.Bharambe said that the BARC’s own findings were in line with what Mumbai Police Commissioner Param Bir Singh had said in his press conference on 8 October. Singh had named Republic TV and two smaller TV channels - Fakt Marathi and Box Cinema – as being involved in TRP manipulations.For all the latest India News, Follow  Section. Most Popularnext ",
    "https://www.newslaundry.com/2021/01/05/trp-scam-how-barc-is-shrouded-in-mystery-over-data-rigging": "TRP scam: How BARC is shrouded in mystery over data rigging MenuMoreTRP scam: How BARC is shrouded in mystery over data riggingAs the investigation into the TRP scam widens, is BARC planning to sacrifice a few former employees?By05 Jan, 2021Shambhavi ThakurWhich is India’s No. 1 English news channel: Republic TV or Times Now? Well, nobody knows the answer because we’re in the dark when it comes to channel ratings as the investigation into the alleged rigging of TRPs is underway.It’s been nearly three months since the scam-hit Broadcast Audience Research Council – which claims to be the world’s largest audience measurement company – suspended the publication of weekly individual ratings for all English, regional and business news channels. And uncertainty still shrouds its resumption.Before its launch in May 2017, Republic TV had allegedly joined hands with several cable TV operators across the country to install its channel as the de-facto landing page. The idea was to ensure that “bar-o-meters” – an audience measurement tool installed by BARC to measure the viewing habits of TV audiences – noted the channel as being “watched” before viewers switched over to other channels.Interestingly, two years later in August 2019, BARC “introduced algorithms” into its data validation method to ease the impact of landing pages on viewership data. This, BARC claimed, was part of its efforts to improve measurement science and mitigate the impact of extraneous factors on viewership.Prior to its launch, Republic TV also erected mammoth hoardings to drum up its arrival. An old-timer told this writer that one of its first hoardings came up in Chennai, a market known for experimenting with new English channels. From massive outdoor publicity to keeping the channel as a landing page, it all seemed like legitimate ways to rake in the all-important TRP numbers.When the new channel, which claimed to be “too loud to be silenced”, pulled down the then seemingly indomitable Times Now to the second spot in the first week itself, there was shock and awe. “We genuinely thought Arnab Goswami, an ex-Times Now guy, had weaved his magic around the English news genre and managed the impossible,” said a Mumbai-based media watcher.Two years and four months later, when Partho Dasgupta, the first chief executive officer of BARC India, stepped down in October 2019 to be replaced by media veteran Sunil Lulla, many thought it was part of a management rejig. Lulla had been a board member before his appointment and was familiar with BARC’s operations. He quickly established himself.But soon after, chief operating officer Romil Ramgarhia called it quits. Sources said an internal report on the working of BARC had pulled several skeletons out of the closet. A forensic inquiry into the data-rigging scam, and an effort to right-size the organisation, seemed to have run parallelly, pushing at least 40 senior and mid-management staff out, bringing down the staff strength to a little over 200.The five-year-old organisation was still bleeding when it decided to cut the staff by at least 10-12 percent. While some were asked to go, some others moved to greener pastures. Among those who left were Rushabh Mehta, head of West; Venkat Samrat, head of South; and Manashi Kumar, chief people officer and head of strategy.In October 2020, BARC India and one of its vendors, Hansa, approached the Mumbai police with a complaint against “suspicious trends and activities”. Certain households were apparently being paid to keep their TV sets on, irrespective of whether they were watching it or not, in order to distort the viewership data in some channels’ favour.In the next two months, the police went on a spree of arrests: of BARC’s ex-CEO Dasgupta, ex-COO Ramgarhia, and 13 others, including Republic TV’s CEO Vikas Khanchandani.Sources say BARC’s promoters – the Indian Broadcasting Foundation, the Advertising Agencies Association of India, and the Indian Society of Advertisers – apparently knew what was going on since 2019. The forensic inquiry had spilled the beans quite summarily. The big question is: why did BARC not approach the police immediately? Did it try to sweep the whole controversy under the carpet for nearly a year? What finally forced it to go to the police in October 2020?A series of no commentsFor the staff and other stakeholders, the data-rigging news was like a bolt from the blue.BARC House in Mumbai’s Parel continues to be shell-shocked. Only one-third of the staff comes to the office daily while others claim to be “working from home” due to the pandemic. Every employee Newslaundry approached sounded terribly scared to talk about the scam that has virtually swallowed the organisation.The top management is tight-lipped. The chairman of BARC, Punit Goenka, who is managing director and CEO of Zee Entertainment Enterprises, refused to talk and passed on the queries to a PR agency. When contacted, BARC CEO Sunil Lulla sent a message, “Will have one of my colleagues call you to understand your questions.”An hour later, the PR agency called to say that BARC won’t be commenting, and sent a one-line response: “As the matter is a subject of ongoing investigation by various law enforcement agencies, we are constrained to respond to your questionnaire.”A board member of BARC told Newslaundry, “In a way, it is good that all the mess is sorted out once and for all. Am sure the whole controversy will die down soon, and BARC will restart its services.” He however refused to answer a query on the forensic inquiry against the tainted senior officials, adding that he can’t divulge any details on the board discussions.A top management official at BARC said, on the condition of anonymity: “Our stakeholders asked us to do some recalibrations. We are doing that. Our audience knows what’s going on. They will be kept in the loop about the progress.” He refused to fix a date by which BARC is likely to restart the rating process for news channels.Interestingly, the internal independent disciplinary council set up by BARC has not discussed anything related to the rigging scam.“The council looks at complaints of malpractices from the subscriber community that includes media agencies and broadcasters,” said a member of the council. “The issue of data rigging never came to our table. As a rule, we don’t look at any employee-related issues.”The statement BARC issued on October 15 was timid, and flatly refused to own up to its responsibility. It said: “A technical committee will review current standards of measurement with a view to improving the statistical robustness of the data and impede potential attempts at infiltrating panel homes.”Simultaneously, BARC said it would cease publishing the weekly individual ratings for all news channels during the exercise: “This exercise is expected to take around 8-12 weeks including validation and testing under the supervision of BARC's Tech Comm. BARC will continue to release weekly audience estimates for the genre of news by state and language.”BARC’s concern, clearly, was only the news genre, where Republic TV figures on top. A second news channel, News Nation, has also been named by the police as being part of the scam.However, the Mumbai police also mentioned four other channels, apart from Republic, as being involved in the scam – Marathi channels Fakt Marathi and Box Cinema, and Maha Movie and Wow music channel. But BARC seems to have cast a blind eye towards them.Arnab at the centreThe controversy was like manna from heaven for the Maharashtra government, which seemed to have been waiting for a chance to go after Goswami. Goswami, after all, had been busy trying to delegitimise the government since its rocky beginnings almost a year ago. Riding his newfound political clout, Goswami’s efforts to communalise a couple of sensitive cases in Maharashtra – the lynching of sadhus in Palghar and the suicide of Sushant Singh Rajput – had landed him in a delicate spot.The Mumbai police has now called BARC ex-CEO Dasgupta the “mastermind” of the scandal. His remand application said he “used” BARC’s measurement science analytics division, which tracks viewership of TV channels, to manipulate TRPs.\"Outlier method, changes in the meta rule method and channel audience control were the three methods used by BARC India to manipulate data attained through bar-o-meters,” , the joint commissioner of police. According to him, the outlier method and the meta rules were altered to help their preferred channels take the top slots. If there wasn’t any human intervention, the AI-supported meta rule would have counted a channel, which is tuned in for several hours on a TV set, an “outlier” and ignored the data provided by the attached bar-o-meter.An insider said BARC’s two-member oversight committee – comprising former chairman Nakul Chopra and industry veteran Praveen Tripathi – set up in June 2020, had cleared the outlier policy and its data validation, .For current BARC CEO Lulla, the scam poses a huge challenge. Identifying the infiltrated panel homes and replacing them is a herculean task. An insider told Newslaundry that increasing the number of bar-o-meters to 40,000 took nearly three years and BARC’s efforts to expand the base to more than 50,000 took a serious beating during the pandemic. Another challenge will be to devise ways to avoid the repeating of such rigging in future.The installation and maintenance of bar-o-meters was outsourced to a few companies, such as Hansa and Market Xcel. “Given the fact that BARC retires one-fourth of the existing panel homes every year, it was a big challenge in the pandemic. As a routine, 10,000 meters had to be replaced with new households. Now, BARC needs to replace all the compromised panel homes too,” the insider said, adding that it is a “murky situation”.He added: “Since the number of bar-o-meters is shrinking, the sampling error could be huge.”TRAI’s new rulesA few months after Lulla took charge, the Telecom Regulatory Authority of India had raised concerns of transparency within BARC. In its recommendations, the telecom regulator suggested that the BARC India board should have at least 50 percent independent members, including a measurement technology expert, a statistician of national repute from the top institutions of the country, and two representatives from the government or regulator.It also added that the restructured board should provide for equal representation of the three constituent industry associations (the Indian Broadcasting Foundation holding 60 percent stake, and the Advertising Agencies Association of India and the Indian Society of Advertisers holding 20 percent each) with equal voting rights, irrespective of their proportion of equity holding.“BARC is yet to revamp the board as per TRAI’s recommendations. It continues to be in 4:2:2 ratio, with broadcasters calling the shots with four members,” said the insider.At present, there are eight members on the board. Apart from the chairman Punit Goenka, the three others representing broadcasters are K Madhavan, managing director, Star & Disney India; Shashi S Vempati, CEO, Prasar Bharati; and Kalli Purie, vice-chairperson, India Today Group. The other board members include Sunil Kataria, business head, Godrej Consumer Products Ltd; Bharat Vithalbhai Patel, ex-CEO, Procter & Gamble;Ashish Bhasin, chairman and CEO, South Asia, Dentsu Aegis Network; and NP Singh, CEO, Multiscreen Media.Once implemented, TRAI's recommendations would mean that broadcasters would lose their board seats and controlling voice in the governing body, despite holding 60 percent equity of BARC.“A committee headed by Prasar Bharati CEO Shashi Vempati is looking into the recommendations and the company’s inputs,” said the board member quoted earlier.Some industry officials told this writer that they believe the whole controversy may be an effort to divert the attention from the “TRAI interference”.TRPs for newsBut the fact is that BARC is finding it tough to explain its role in the whole rigging case. Several thousands of crores of advertisers’ money are riding on the BARC’s shoulders.Are GRPs, or gross rating points, and TRPs so important in the news TV genre? GRP is nothing but a mathematical equation used by media planners and buyers to determine how many people within an intended audience might have seen their ads. TRP, or target rating point, is a fine-tuning of GRPs. While GRPs refer to the total audience exposure to advertising messages, TRPs relate to the target audience exposure.Media buyers are closely tracking and re-evaluating their media spend as the scam spreads. Most brands had continued with their spend, thinking that the controversy was politically motivated, until more arrests and evidence came to bother them.However, a senior media buying executive at a US-based media marketing giant tried to downplay the impact. “In India, GECs [general entertainment channels] are governed by GRPs, news channels aren’t. Most advertisers are spending 5-10 percent of their total ad spend in news channels,” he said. “This deployment will continue. The BARC controversy has not brought in any lateral shift.”Cost-wise, there is absolutely no comparison between the two genres of news and GECs. “Say, 20 spots in GEC may be equal to 2,000 spots in news channels,” he said.In the Covid era, news as a genre has benefited the most, according to the media buying executives. “Most advertisers want to be present in news channels,” said an executive, on the condition of anonymity.What is bothering BARC now is the police’s version that the data manipulation didn’t end with news channels. The police had said there is “evidence of a similar forgery in GEC data too”.According to the Mumbai police, a channel whose CEO quit recently was also party to the rigging.As the probe widens, Republic TV seems to have toned down its pitch by a few notches. The channel, which has thrived on nationalism so far, claims that Republic “is not one man, it’s the united might of the people”. Post the controversy, will it continue to blaze a trail and show the united might of the people?The Mumbai police will tell us soon.NL DigestA weekly guide to the best of our stories from our editors and reporters.TAGSPay to keep news free Complaining about the media is easy and often justified. But hey, it’s the model that’s flawed.You may also like"
}